Repository: raccoongang/FeedbackXBlock
Catalog: feedback/translations/*/LC_MESSAGES/text.po
Languages: ru

source: What did you learn from this? What was missing?
ru: Что вы узнали из этого? Чего не хватало?

source: How would you rate this as a learning experience?
ru: Как бы вы оценили это, как обучающий опыт?

source: Take a little bit of time to reflect here. Research shows that a meaningful synthesis will help you better understand and remember material from this course.
ru: Найдите немного времени, чтобы поразмыслить здесь. Исследования показывают, что осмысленный синтез поможет вам лучше понять и запомнить материал этого курса.

source: Freeform user prompts
ru: Высказывание пользователя в свободной форме

source: Random number generated for p. -1 if uninitialized
ru: Случайное число сгенерировано для p. -1 если неинициализировано

source: How user voted. -1 if didn't vote
ru: Как проголосовал пользователь. -1 если не голосовал

source: What percent of the time should this show?
ru: В каком проценте случаев это должно показываться?

source: A list of user votes
ru: Список голосов пользователей

source: Feedback
ru: Отзыв

source: Enables ability to add text feedback for a student
ru: Позволяет студенту добавить текстовый отзыв

source: Enables ability to add extra 0 grade
ru: Включить возможность добавлять дополнительную 0 оценку

source: Display Name
ru: Отображаемое имя

source: Provide Feedback
ru: Обратная связь

source: The display name for this component.
ru: Отображаемое имя данного компонента.

source: Thank you for voting!
ru: Спасибо за Ваш голос!

source: Please, vote!
ru: Пожалуйста, проголосуйте!

source: Thank you for your feedback!
ru: Спасибо за Ваш отзыв!

source: This XBlock allows you to collect student feedback on pieces of the course. This may be helpful either for course improvement, or to give students a chance to reflect on what they have done.
ru: Этот XBlock позволяет собирать отзывы студентов о частях курса. Это может быть полезно либо для улучшения курса, либо для того, чтобы студенты могли подумать о том, что они сделали.

source: Prior to using this block, we recommend reading about best practices in the edX documentation. In particular, we do recommend asking for structured, specific feedback, and we advise using this in conjunction with the <a href="http://edx.readthedocs.org/projects/edx-partner-course-staff/en/latest/content_experiments/content_experiments_configure.html">RCT framework</a> for matrix sampling.
ru: Перед использованием этого блока мы рекомендуем прочитать лучшие практики в документации edX. В частности, мы рекомендуем запрашивать структурированный, конкретный отзыв, и мы советуем использовать его вместе с <a href="http://edx.readthedocs.org/projects/edx-partner-course-staff/en/latest/content_experiments/content_experiments_configure.html">RCT ферймворком</a> для матричной выборки.

source: Display name
ru: Отображаемое имя

source: Enable text area answer
ru: Включить ответ в текстовой форме

source: Freeform prompt
ru: Подсказка для текстового поля ответов в произвольной форме

source: Example: Please provide us feedback on this section.
ru: Пример: поделитесь с нами своим мнением об этом разделе.

source: Freeform placeholder
ru: Содержимое текстового наполнителя

source: This is shown as grayed out text before the student has answered.
ru: Содержимое данного поля отображается внутри текстового поля ответов в свободной форме

source: Likert prompt
ru: Оценочная подсказка

source: Example: Please rate your overall experience with this section.
ru: Пример. Оцените, насколько вам понравился этот раздел.

source: Set your assessment text to the each input below. For example, "Excellent".
ru: Задайте текст экзамена для каждого поля ниже. Например, "Отлично".

source: Activate 0 grade
ru: Активировать 0 оценку

source: Likert option
ru: Оценочная опция

source: Save
ru: Сохранить

source: Cancel
ru: Отменить

source: Submit Feedback
ru: Отправить отзыв
